app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test location 2"], ["created_at", "2023-01-29 02:48:29.866291"], ["updated_at", "2023-01-29 02:48:29.866291"]]