app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "priority", "description", "supply1", "supply2", "supply3", "supply4", "supply5", "supply6", "supply7", "supply8", "supply9", "supply10", "estimate", "start", "completion", "created_at", "updated_at", "location_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    if @project.save

UPDATE "projects" SET "priority" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["priority", "medium"], ["updated_at", "2023-02-04 02:51:45.561311"], ["id", 1]]
---
  def update
    if @project.update(project_params)